import React from 'react'
import { images } from '../../images'
import Image from 'next/image'


export default function About() {



  return (
    < >
      <div style={{ direction: 'rtl', fontSize: 'large' }}>
        <div style={{ width: '65%', marginRight: '17.5%', textAlign: 'center' }}>
          <h1>חברת אלי שטרן פרויקטים היא אחת החברות המתקדמות והמבטיחות בתחום הבניה המתקדמת בישראל</h1>
        </div>

        <div style={{ width: '94%', marginRight: '3%' }}>
          <h2>למה ES Projects?</h2>
          <p>
            אנחנו ב ES פרויקטים מאמינים כי הצלחת הפרויקט תלויה רבות ביכולת הראיה הכוללת והטמעתה בשילוב האופטימלי של כל האלמנטים השונים והפיכתם ליצירה אחת מושלמת. אחרי שנים רבות של ניהול ופיקוח פרויקטים וצבירת ידע וניסיון רב, החלטנו לשלב כוחות על מנת להקים את ES פרויקטים, חברה שתיתן מענה מלא תחת קורת גג אחת! אנחנו מספקים ללקוחותינו פתרונות מלאים החל מרמת טרום התכנון ועד רמת הביצוע ומסירת הפרויקט. אנחנו כאן כדי להפוך כל חלום שלכם למציאות!
          </p>
          <p>
            אנו מתמחים בשיטות בניה מתקדמות המשלבות באופן ייחודי יתרונות של עלות, מהירות, קיימות וביצועים. החברה עובדת עם מפעלים שונים ומגוונים בעלי תקן 9001:ISO ומשתמשת במוצרים המיוצרים מחומרים ברמות הגימור והבטיחות הגבוהות ביותר המתאימים לתקינה הישראלית וכן עומדים בכל התקנים האירופים המחמירים.
          </p>
          <p>
            יבוא הפלדה שלנו מאפשר לנו לתת ללקוחותינו פתרונות לכל צורה או היקף עבודה שיידרש ולצרף לשולחן התכנון והביצוע יכולות שימוש במוצרים חדשים ובטכנולוגיות מתקדמות את את התוצאות אנו רואים בשטח בכל פרויקט. החברה מתגאה בהיקף ומגוון פרויקטים נרחב בארץ ובחו"ל ושותפויות מוצלחות ופורות עם מגוון חברות מובילות בשוק הבניה הפרטית והתעשייתית נשמח לצרף אתכם למשפחת הלקוחות המרוצים שלנו ולספק לכם פתרונות מלאים בפרויקט הבא שלכם. אנו מזמינים אתכם להיות שותפים לדרכנו הדוגלת בבניה איכותית ומתפתחת ושותפות גאה בבניין הארץ!
          </p>
        </div>


        <div style={{ width: '94%', marginRight: '3%' }}>
          <h2>רוח החברה</h2>
          <p>
            שמנו לנו למטרה להביא אל הלקוח את השירות הטוב ביותר ולתקן את ההרגשה הרווחת על נותני השירות בתחום הבניה. אנחנו רואים חשיבות גבוהה בשמירה על יחסי אנוש גבוהים ושיתוף פעולה מלא בכל שלבי הביצוע מול הלקוח,

            ובמקביל מחויבים למטרה החשובה מכל – לתת ללקוחותינו לראות את הפרויקט שחלמו רוקם אור וגידים כפי שציפו וחלמו!
          </p>
        </div>


        <div style={{ width: '94%', marginRight: '3%' }}>
          <h2>יתרונות החברה</h2>
          <ul>
            <li>שירות אמין מקצועי ואישי לאורך כל שלבי הפרויקט</li>
            <li>ניסיון רב שנים ומקיף בארץ ובעולם</li>
            <li>יעילות שקיפות ואמינות תוך שמירה על מעורבות הלקוח</li>
            <li>טכנולוגיה מתקדמת ורמת גימור גבוהה</li>
            <li>חברה אנרגטית נמרצת וחדשנית</li>

          </ul>
        </div>


        <div style={{ width: '50%', margin: 'auto' }}>
          <div>

            <div style={{ width: '30%', margin: 'auto', textAlign: 'center' }}>
              <h2>צוות החברה</h2>
              <Image style={{ width: 200, height: 250 }} src={images.eli_shtern_image} alt='' />
            </div>

            <div>
              <h2>אלי שטרן</h2>
              <p>
                החל את דרכו בתחום הפלדה לפני 29 שנים בהקמת חברה לייצור מתכות. החברה עסקה בייצור והרכבה של קונסטרוקציות מתכת שונות בארץ ובעולם. כ-15 שנה ניהל את החברה, הביא אותה להישגים מרשימים, תכנן ונתן שירות לחברות רבות בתחום הקונסטרוקציות הייעודיות לתעשייה, לתחום המבנים, הגשרים, המעליות, מדרגות החירום ועוד..
                בהמשך דרכו המקצועית התמחה והתמקצע בניהול ופיקוח פרויקטים בענף הבניה והתעשייה בעיקר בחו"ל בחברת הרמן זמל פרויקטים בע"מ. במסגרת עבודתו בחברה היה אחראי על פרויקטים רבים בכל שלבי הביצוע. פרויקטים אלה כללו הרכבות קונסטרוקציית פלדה, עבודות בטון מגוונות, בניית קווי מים ובורות שאיבה.
                אלי מביא עמו את ניסיונו הרב בפרויקטים הכוללים בניית קונסטרוקציות מתכת ואת מקצועיותו בתחום ניהול הפרויקטים בחברת אלי שטרן פרויקטים וללקוחותיה.
              </p>
            </div>

            <div style={{ marginTop: 50, textAlign: 'center' }}>
              <h2>תקינה ישראלית ובין לאומית</h2>
              <div style={{ display: 'flex', justifyContent:'space-between', margin:20 }}>
                  <Image
                    style={{ width: 120, height: 44, marginTop:40 }}
                    src={images.Standardization_images[0]} alt='' />
                  <Image
                    style={{ width: 120, height: 120 }}
                    src={images.Standardization_images[1]} alt='' />
                  <Image
                    style={{ width: 120, height: 120 }}
                    src={images.Standardization_images[2]} alt='' />
                  <Image
                    style={{ width: 120, height: 120 }}
                    src={images.Standardization_images[3]} alt='' />
                </div>
            </div>
          </div>
        </div>
      </div>
    </>
  )
}
