import React from 'react'
import { images } from '../../images'
import Image from 'next/image'



export default function AreasOfExpertise() {
  return (
    <>
      <div style={{ direction: 'rtl' }}>

        <div style={{ display: 'flex', flexDirection: 'row-reverse', width: '98%', margin: '1%'}}>
          <Image style={{ width:'50%', height:'auto' }} src={images.Industrial_Construction_image} alt='' />
          <div style={{ margin: 20 ,width:'50%'}}>
            <h1>בניה תעשייתית</h1>
            <p style={{ fontSize: 'x-large'}}>
              בניה התעשייתית בניה של מבנים תעשייתיים כגון מפעלים, מרל"וגים וכו'. עקרונותיה הבסיסיים מתייחסים לבנייה קונבנציונלית של ביסוס המבנה ולאחר מכן חומרים מתקדמים יותר כגון פלדה וחיפוי קירות מחומרים שונים ומגוונים. בבנייה התעשייתית שמים דגש על ההרכבה המהירה של הפלדה עבור מעטפת הבניין וכהכנה עבור  חיפויי הקירות וקירוי הגג. מהירות זו יוצרת פגיעה מינימאלית בסביבה הקרובה למבנה. שיטה חוסכת כסף ליזם וזאת עקב קיצור לוחות זמני ביצוע באופן משמעותי ביותר. שיטת בניה תעשייתית מאפשרת בקרה מלאה על כל תהליכי הבנייה ועל שילובי החומרים לצרכי בניית שלד המבנה, דבר שמשפר את איכות המבנה. שילובי החומרים הללו יחד ואיכות הבניה מבטאים את מגמה ירוקה ההולכת ומתפתחת כיום בעולם. הבניה התעשייתית מבוססת על שימושים בחומרים שונים ומגוונים אשר גורמים להפחתה של נזקי רעש ולכלוך פוחתים ומונעים פגיעה ישירה בציבור הסביבתי שקרוב לאתר הבניה.
            </p>
          </div>
        </div>

        <div style={{ display: 'flex', flexDirection: 'row', width: '98%', margin: '1%', marginTop:'-1%'}}>
          <Image style={{ width:'50%', height:'auto' }} src={images.Advanced_construction_image} alt='' />
          <div style={{ margin: 20 ,width:'50%'}}>
            <h1>בנייה מתקדמת</h1>
            <p style={{ fontSize: 'x-large'}}>
            בניה מתקדמת או בשמה הנוסף בניה ירוקה היא בניה איכותית בסטנדרט הגבוה ביותר. שמה לה למטרה ומתגאה בידידותיות ואורח חיים בריא ונקי לדיירי הבית תוך מזעור הנזק הסביבתי. חלק מיתרונותיה הגדולים הם: עמידות מבנה גבוהה, זמן בניה מהיר, עלויות תחזוקת מבנה נמוכות, יעילות אנרגטית גבוהה קרי הוזלה בחשבונות השוטפים וכמובן התחשבות מרבית בטבע ובסביבה. בניגוד לדעה הרווחת, בניה ירוקה אינה בהכרח יקרה יותר ואינה דורשת עיצוב אחר או שונה אלא חסכונית ומאפשרת. בניה ירוקה היא הצהרה חברתית, בריאותית ומתגמלת לבוחרים בה!            
            </p>
          </div>
        </div>


        <div style={{ display: 'flex', flexDirection: 'row-reverse', width: '98%', margin: '1%', marginTop:'-1%'}}>
          <Image style={{ width:'50%', height:'auto' }} src={images.Import_Of_Steel_Products_image} alt='' />
          <div style={{ margin: 20 ,width:'50%'}}>
            <h1>ייבוא פלדה</h1>
            <p style={{ fontSize: 'x-large' }}>
            אנו מייצגים את מיטב יצרני vפלדה בארץ ובעולם, תוך הקפדה על איכות המוצרים המשווקים. החברה עוסקת ביבוא מוצרי פלדה איכותיים וביניהם ,קונסטרוקציות פלדה עבור מפעלים ומ"רלוגים, מעקות בטיחות לגשרים וכבישים , עמודים עבור קירות אקוסטיים, אלמנטים מורכבים ומתועשים ע"פ דרישה. קו המוצרים שלנו מגוון, וכולל סוגים שונים של ברזל המיועד לכל צורכי השוק.הברזל שאותו אנו מייבאים עומד בכל דרישות האיכות של מכון התקנים הישראלי ומגיע ברמות חוזק שונות.            
            </p>
          </div>
        </div>


        <div style={{ display: 'flex', flexDirection: 'row', width: '98%', margin: '1%', marginTop:'-1%'}}>
          <Image style={{ width:'50%', height:'auto' }} src={images.Private_Construction_image} alt='' />
          <div style={{ margin: 20 ,width:'50%'}}>
            <h1>בנייה פרטית</h1>
            <p style={{ fontSize: 'x-large' }}>
              בניה פרטית עבור לקוחות פרטיים 
            </p>
          </div>
        </div>


      </div>

    </>
  )
}
