import React, { useContext, useEffect } from 'react'
import { images } from '../../images'
import Image from 'next/image'
import Link from 'next/link'
import styles from '../../styles/Home.module.css'
import { Button } from '@chakra-ui/react'



export const AreasOfWork_Data = [
    {
        name: 'בנייה פרטית',
        description: "תהליך בניית בית הוא מורכב הדורש זמן והשקעה וכן כרוך בהתמודדות מול בעלי מקצוע רבים. ללא ידע ניסיון ומקצועיות תהליך זה יכול להפוך לגוזל זמן ומתסכל לבונה הפרטי. פה אנחנו נכנסים לתמונה! אלמנט מתמחה בבניה מתקדמת וירוקה ומספקת ללקוחותיה פתרונות מלאים החל מרמת טרום התכנון ועד רמת הביצוע ומסירת הפרויקט והופכת את חזונכם למציאות.",
        fullText: "בנייה פרטית היא צורת הבנייה המקובלת בימינו. הבנייה הפרטית מאופיינת בהקמת יסודות, רצפות בטון התלויות על קורות וקירות העשויים בלוקים. הבנייה הקונבנציונלית עושה שימוש בבטון ככלי העיקרי בבניית השלד. זוהי שיטה נפוצה בשל עלויות חומרי הבנייה היחסית נמוכות (חול ומלט) וגם בגלל כוח העבודה הזול והמיומן בעבודה עם חומרים אלה. הבנייה הפרטית מצריכה מעט יותר עבודה ורלוונטית בעיקר לבניית מבנים למגורים, בעיקר שלד של עמודים ותקרות מקשיות מבטון מזוין, על קירות חוץ ומחיצות מבלוקי בטון או איטונג, ציפוי קירות חוץ ופנים מטיח, וריצוף טרצו או קרמיקה על מצע חול וטיט. אפשר לשלב בבנייה מסוג זה גם קירות גבס כמחיצות פנים במקומות בהם דרושה יותר גמישות אדריכלית.",
        image: images.Private_Construction_image
    },
    {
        name: "בנייה תעשייתית",
        description: "בבניה לשוק העסקי והתעשייתי הזמן הוא פקטור חשוב! לכן מענה מלא משלב הרעיון ועד מסירת המבנה ותכנון מתקדם בהתאמה לצורכי הפרויקט הופך לחיוני מאין כמוהו. אנו מתמחים בייצור קונסטרוקציות בארץ או ביבוא מחו\"ל המתאפיינות בזמן הרכבה מהיר בשיטת ה Plug & Play והתוצאה הסופית היא ביצוע איכותי וחסכוני בזמן.",
        fullText: "בניה התעשייתית בניה של מבנים תעשייתיים כגון מפעלים, מרל\"וגים וכו'. עקרונותיה הבסיסיים מתייחסים לבנייה קונבנציונלית של ביסוס המבנה ולאחר מכן חומרים מתקדמים יותר כגון פלדה וחיפוי קירות מחומרים שונים ומגוונים. בבנייה התעשייתית שמים דגש על ההרכבה המהירה של הפלדה עבור מעטפת הבניין וכהכנה עבור  חיפויי הקירות וקירוי הגג. מהירות זו יוצרת פגיעה מינימאלית בסביבה הקרובה למבנה. שיטה חוסכת כסף ליזם וזאת עקב קיצור לוחות זמני ביצוע באופן משמעותי ביותר. שיטת בניה תעשייתית מאפשרת בקרה מלאה על כל תהליכי הבנייה ועל שילובי החומרים לצרכי בניית שלד המבנה, דבר שמשפר את איכות המבנה. שילובי החומרים הללו יחד ואיכות הבניה מבטאים את מגמה ירוקה ההולכת ומתפתחת כיום בעולם. הבניה התעשייתית מבוססת על שימושים בחומרים שונים ומגוונים אשר גורמים להפחתה של נזקי רעש ולכלוך פוחתים ומונעים פגיעה ישירה בציבור הסביבתי שקרוב לאתר הבניה.",
        image: images.Industrial_Construction_image

    },

    {
        name: "ייבוא מוצרי פלדה",
        description: "ישראל היא מדינה קטנה ייבוא מוצרי פלדה מחו\"ל מאפשר תכנון חופשי וגמיש והתאמת המוצר לחזון ללא פשרות. הייבוא מצרף לשולחן התכנון יכולות כמו שימוש במוצרים חדשים וטכנולוגיות מתקדמות התורמות למוצר סופי ייחודי.ולעיתים ההיצע בשוק הפלדה מוגבל ומביא לחוסר גמישות. פעמים רבות התכנון משתנה ונכפית התאמתו להיצע.",
        fullText: "אנו מייצגים את מיטב יצרני vפלדה בארץ ובעולם, תוך הקפדה על איכות המוצרים המשווקים. החברה עוסקת ביבוא מוצרי פלדה איכותיים וביניהם ,קונסטרוקציות פלדה עבור מפעלים ומ\"רלוגים, מעקות בטיחות לגשרים וכבישים , עמודים עבור קירות אקוסטיים, אלמנטים מורכבים ומתועשים ע\"פ דרישה. קו המוצרים שלנו מגוון, וכולל סוגים שונים של ברזל המיועד לכל צורכי השוק.הברזל שאותו אנו מייבאים עומד בכל דרישות האיכות של מכון התקנים הישראלי ומגיע ברמות חוזק שונות.",
        image: images.Import_Of_Steel_Products_image
    },
    {
        name: 'בנייה מתקדמת',
        description: "בניה מתקדמת או בשמה הנוסף בניה ירוקה היא בניה איכותית בסטנדרט הגבוה ביותר. שמה לה למטרה ומתגאה בידידותיות ואורח חיים בריא ונקי לדיירי הבית תוך מזעור הנזק הסביבתי. חלק מיתרונותיה הגדולים הם: עמידות מבנה גבוהה, זמן בניה מהיר, עלויות תחזוקת מבנה נמוכות, יעילות אנרגטית גבוהה קרי הוזלה בחשבונות השוטפים וכמובן התחשבות מרבית בטבע ובסביבה. בניגוד לדעה הרווחת, בניה ירוקה אינה בהכרח יקרה יותר ואינה דורשת עיצוב אחר או שונה אלא חסכונית ומאפשרת. בניה ירוקה היא הצהרה חברתית, בריאותית ומתגמלת לבוחרים בה!",
        fullText: "בניה מתקדמת או בשמה הנוסף בניה ירוקה היא בניה איכותית בסטנדרט הגבוה ביותר. שמה לה למטרה ומתגאה בידידותיות ואורח חיים בריא ונקי לדיירי הבית תוך מזעור הנזק הסביבתי. חלק מיתרונותיה הגדולים הם: עמידות מבנה גבוהה, זמן בניה מהיר, עלויות תחזוקת מבנה נמוכות, יעילות אנרגטית גבוהה קרי הוזלה בחשבונות השוטפים וכמובן התחשבות מרבית בטבע ובסביבה. בניגוד לדעה הרווחת, בניה ירוקה אינה בהכרח יקרה יותר ואינה דורשת עיצוב אחר או שונה אלא חסכונית ומאפשרת. בניה ירוקה היא הצהרה חברתית, בריאותית ומתגמלת לבוחרים בה!",
        image: images.Advanced_construction_image

    },

]




export default function HomePage() {
    // const size = useContext(AppContext);
    // console.log(size);


    return (
        <div>
            {/* <div >
                <Image
                    className={styles.homePage_image}
                    src={images.homePage_image}
                    priority
                    alt="" />
            </div > */}


            <div style={{ display: 'flex', justifyContent: 'center', marginTop: -30 }}>
                <div style={{ textAlign: 'center', width: 850 }}>
                    <p style={{ fontSize: 50 }}>אנחנו בונים את העתיד</p>
                    <p style={{ fontSize: 20, marginTop: -30 }}>כל פרויקט בניה קטן כגדול דורש שילוב של אלמנטים רבים ושונים (עיצוב, תכנון, בחירת חומרים, ביצוע, מים, חשמל ועוד..) הצלחת הפרויקט תלויה רבות ביכולת הראיה הכוללת והטמעתה האופטימלית בשילוב כל האלמנטים השונים. אנו נותנים מענה מלא תחת גג אחד ונהפוך כל אלו ליצירה אחת מושלמת.</p>
                    <div style={{ display: 'flex', justifyContent: 'center' }}>

                        <Link style={{ textDecoration: 'none' }} href='/Com/Projects'>
                            <Button style={{cursor:"pointer"}} colorScheme='teal' variant='solid'>
                                צפה בפרוייקטים
                            </Button>
                        </Link>
                    </div>
                </div>
            </div>


        </div>
    )
}
