import { images } from '../images_Projects'


export const projects_Data = [
    {
        "project_ID": 1,
        "title": "מבנה חנויות ומשרדים - קרית גת",
        "category": "Industrial_Construction",
        "images": images.Shops_and_offices_building_KiryatGat,
        "description": 
        `<div>
                <p>יזם : גרין לוגיסטיק בע"מ.</p>
                <p>סה"כ מבנה – 2,500 מ"ר.</p>
                <p>אלמנטים בפרויקט  – קונסטרוקציה פלדה מלאה כולל גגון .</p>
                <p>קונסטרוקציית פלדה כבדה – 185 טון פלדה יבוא מסין.</p>
                <p>רצפה וגגות – פלקסדקס כולל סטדים.</p>
                <p>צביעת הפלדה בצבע נגד אש מעכב בעירה למשך 120 דקות.</p>
                <p>חיפוי קירות – פנל נסתר מבודד במילוי צמר סלעים דגם wave של חברת סטיל רולינג.</p>
        </div>`,
    },

    {
        "project_ID": 2,
        "title": "מפעל עיבוד שבבי - בית שאן",
        "category": "Industrial_Construction",
        "images": images.Machining_BeitShan,
        "description": `
        <div>
                <p>תכנון : דקל הנדסה.</p>
                <p>סה"כ שטח מבנה פלדה   – 1,120 מ"ר.</p>
                <p>משקל הפלדה : 54 טון.</p>
                <p>אלמנטים בפרויקט  – עמודים, קירות, תקרה, מדרגות.</p>
                <p>חיפוי גגות – פנל מבודד 100 מ"מ של חברת פולי פח.</p>
                <p>חיפוי קירות – פנל מבודד 50 מ"מ בהתקנה נסתרת של חברת פולי פח.</p>
        </div>`,
    },

    {
        "project_ID": 3,
        "title": "מפעל אקלמטיק – ציפורית",
        "category": "Industrial_Construction",
        "images": images.Aclimatic_Tsivorit,
        "description": `
        <div>
            <p>תכנון : רייכט מהנדסים ויועצים בע"מ.</p>
            <p>אדריכלות : פי שניים דיזיין בע"מ</p>
            <p>סה"כ מבנה – 1,200 מ"ר.</p>
            <p>אלמנטים בפרויקט  – עמודים, קירות, תקרה, פיר מעלית ומדרגות פלדה.</p>
            <p>חיפוי גגות – פנל מבודד 100 מ"מ של חברת סטיל רולינג.</p>
            <p>חיפוי קירות – פנל נסתר מבודד דגם wave של חברת סטיל רולינג.</p>
            <p>קונסטרוקציית פלדה כבדה – 70 טון פלדה יבוא מסין.</p>
        </div>
        `,
    },
    {
        "project_ID": 4,
        "title": "מרלו\"ג נעורים – חברת אלקטריאון",
        "category": "Industrial_Construction",
        "images": images.YouthMarlog_ElectronCompany,
        "description": `
        <div>
            <p>סה"כ מבנה – 650 מ"ר, מתוכם 300 מ"ר משרדים ו- 350 מ"ר שטח פעילות חברה.</p>
            <p>קונסטרוקציית פלדה דקת דופן של חברת מייטק.</p>
            <p>חיפוי אלומיניום – פח גלי.</p>
            <p>תכנון אדריכלי – לילך צוריאל.</p><br/>
            <p>משך הבניה: כ-5 חודשים.</p>
        </div>
        `,
    },
    {
        "project_ID": 5,
        "title": "מרלו\"ג עין שמר – חברת ביגוד",
        "category": "Industrial_Construction",
        "images": images.Marlog_EinShemer_ClothingCompany,
        "description": `
        <div>
            <p>סה"כ מבנה – 2,500 מ"ר, מתוכם 1,700 מ"ר מחסן, ו-800 מ"ר משרדים.</p>
            <p>אלמנטים טרומיים – עמודים, קירות, תקרה, רצפה.</p>
            <p>חיפוי – פנל מבודד.</p>
            <p>קונסטרוקציית פלדה כבדה – יבוא מסין.</p><br/>
            <p>משך הבניה: כ-12 חודשים.</p>
        </div>
        `,
    },
    {
        "project_ID": 6,
        "title": "חיזוק מנהרת דחיקה – חברת חשמל",
        "category": "Import_Of_Steel",
        "images": images.ReinforcementThrustTunnel_TheElectricCompany,
        "description": `
        <div>
            <p>חיזוק מנהרת דחיקה מחוליות בטון ע"י 28 טבעות פלדה.</p>
            <h2>טכנולוגיה</h2>
            <p>טבעות הפלדה יוצרו לאחר מדידה בשטח של המנהרה ועברו ליווי מלא בשלבי הייצור ע"מ ליצור התאמה מלאה בשטח.</p>
            <p>הטבעות יוצרו מפלדה ST52 והורכבו בשטח ע"י ברגים בלבד ללא צורך בריתוכים.</p>
            <h2>זמנים</h2>
            <p>חודש ייצור ושבוע התקנה בשטח.</p>
        </div>
        `,
    },
    {
        "project_ID": 7,
        "title": "גידור בטחוני – חברת החשמל",
        "category": "Industrial_Construction",
        "images": images.SecurityFencing_TheElectricCompany,
        "description": `
        <div>
            <p>גידור מתחם תחמ"ג אילון של חברת החשמל ב-700 מטר אורך גדר ביטחונית CATEGORY 3 בגובה 3 מטר, גדר המעכבת פריצה 10 דקות לפחות.</p>
            <h2>טכנולוגיה</h2>
            <p>גדר בצפיפות גבוהה וקשיחה ביותר עם ציפוי בעובי 340 מיקרון.</p>
        </div>
        `,
    }

]


